# ðŸš€ ADVANCED SQL

---

## ðŸ“‹ **DAY 5 - LESSON 2: ADVANCED SQL**

### **ðŸŽ¯ Má»¤C TIÃŠU:**

1. **Window Functions** - ROW_NUMBER, RANK, LAG, LEAD
2. **Complex Joins** - Self-join, Cross join
3. **Set Operations** - UNION, INTERSECT, EXCEPT
4. **Pivot & Unpivot** - Transform data
5. **Advanced Aggregations** - ROLLUP, CUBE, GROUPING SETS
6. **Performance Tips** - Optimize SQL queries

---

## ðŸ’¡ **ADVANCED SQL:**

- Window functions cho analytics
- Complex joins cho hierarchical data
- Set operations cho data comparison
- Pivot/Unpivot cho reporting
- Advanced aggregations cho subtotals

---

## ðŸ”§ **SETUP**

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql import functions as F
from pyspark.sql.functions import col, lit, when, desc, asc
from pyspark.sql.functions import row_number, rank, dense_rank, percent_rank, ntile
from pyspark.sql.functions import lag, lead, first, last
from pyspark.sql.functions import sum as spark_sum, avg as spark_avg, count as spark_count
from pyspark.sql.functions import round as spark_round
from pyspark.sql.window import Window
from pyspark.sql.types import *
import time
import random
from datetime import datetime, timedelta

spark = SparkSession.builder \
    .appName("AdvancedSQL") \
    .master("spark://spark-master:7077") \
    .config("spark.executor.memory", "2g") \
    .config("spark.driver.memory", "1g") \
    .config("spark.sql.adaptive.enabled", "true") \
    .config("spark.hadoop.fs.s3a.endpoint", "http://minio:9000") \
    .config("spark.hadoop.fs.s3a.access.key", "minioadmin") \
    .config("spark.hadoop.fs.s3a.secret.key", "minioadmin123") \
    .config("spark.hadoop.fs.s3a.path.style.access", "true") \
    .config("spark.hadoop.fs.s3a.impl", "org.apache.hadoop.fs.s3a.S3AFileSystem") \
    .getOrCreate()

print("âœ… Spark Session Created")
print(f"Spark Version: {spark.version}")

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
26/01/11 15:44:26 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

âœ… Spark Session Created
Spark Version: 3.5.1

---

## ðŸ“Š **1. Táº O DATA MáºªU**

In [2]:
print("="*80)
print("ðŸ“Š 1. GENERATING SAMPLE DATA")
print("="*80)

# Employees data
departments = ["Engineering", "Sales", "Marketing", "HR", "Finance"]
countries = ["USA", "UK", "Germany", "France", "Canada"]

print("\nðŸ”¹ Generating employees data...")

employees_data = []
for i in range(1, 501):
    dept = random.choice(departments)
    country = random.choice(countries)
    
    base_salary = {
        "Engineering": 80000,
        "Sales": 70000,
        "Marketing": 65000,
        "HR": 60000,
        "Finance": 75000
    }[dept]
    
    salary = base_salary + random.randint(-10000, 30000)
    
    # Manager ID (some employees have managers)
    manager_id = None
    if i > 50:  # First 50 are managers
        manager_id = f"EMP{random.randint(1, 50):04d}"
    
    employees_data.append((
        f"EMP{i:04d}",
        f"Employee {i}",
        random.randint(22, 60),
        dept,
        country,
        salary,
        manager_id,
        random.choice(["Active", "Active", "Active", "Inactive"]),
        (datetime(2020, 1, 1) + timedelta(days=random.randint(0, 1460))).strftime("%Y-%m-%d")
    ))

employees = spark.createDataFrame(employees_data,
    ["employee_id", "name", "age", "department", "country", "salary", "manager_id", "status", "hire_date"])

print(f"âœ… Generated {employees.count():,} employees")
employees.show(5)

# Sales data
print("\nðŸ”¹ Generating sales data...")

sales_data = []
sale_id = 1
for month in range(1, 13):
    for day in [1, 15]:
        for emp_id in random.sample(range(1, 101), 20):
            sales_data.append((
                f"SALE{sale_id:05d}",
                f"EMP{emp_id:04d}",
                f"2024-{month:02d}-{day:02d}",
                random.randint(1000, 50000),
                random.choice(["Product A", "Product B", "Product C", "Product D"])
            ))
            sale_id += 1

sales = spark.createDataFrame(sales_data,
    ["sale_id", "employee_id", "sale_date", "amount", "product"])

print(f"âœ… Generated {sales.count():,} sales records")
sales.show(5)

# Create temporary views
employees.createOrReplaceTempView("employees")
sales.createOrReplaceTempView("sales")

print("\nâœ… Created temporary views: employees, sales")

================================================================================
ðŸ“Š 1. GENERATING SAMPLE DATA
================================================================================

ðŸ”¹ Generating employees data...

âœ… Generated 500 employees
+-----------+----------+---+----------+-------+------+----------+--------+----------+
|employee_id|      name|age|department|country|salary|manager_id|  status| hire_date|
+-----------+----------+---+----------+-------+------+----------+--------+----------+
|    EMP0001|Employee 1| 33|     Sales|    USA| 81958|      NULL|  Active|2022-07-30|
|    EMP0002|Employee 2| 43|        HR|Germany| 63411|      NULL|  Active|2020-12-12|
|    EMP0003|Employee 3| 22|   Finance| France| 70931|      NULL|Inactive|2021-01-11|
|    EMP0004|Employee 4| 33| Marketing|     UK| 60074|      NULL|  Active|2023-08-09|
|    EMP0005|Employee 5| 48| Marketing| Canada| 87114|      NULL|  Active|2022-06-20|
+-----------+----------+---+----------+-------+------+----------+--------+----------+
only showing top 5 rows


ðŸ”¹ Generating sales data...
âœ… Generated 480 sales records
+---------+-----------+----------+------+---------+
|  sale_id|employee_id| sale_date|amount|  product|
+---------+-----------+----------+------+---------+
|SALE00001|    EMP0003|2024-01-01| 22472|Product A|
|SALE00002|    EMP0067|2024-01-01| 31633|Product B|
|SALE00003|    EMP0061|2024-01-01| 34789|Product B|
|SALE00004|    EMP0060|2024-01-01| 29017|Product B|
|SALE00005|    EMP0037|2024-01-01| 28487|Product C|
+---------+-----------+----------+------+---------+
only showing top 5 rows


âœ… Created temporary views: employees, sales

---

## ðŸªŸ **2. WINDOW FUNCTIONS**

### **Window Functions lÃ  gÃ¬?**
- TÃ­nh toÃ¡n trÃªn má»™t "cá»­a sá»•" (window) cá»§a rows
- KhÃ´ng lÃ m giáº£m sá»‘ rows (khÃ¡c vá»›i GROUP BY)
- Syntax: `function() OVER (PARTITION BY ... ORDER BY ...)`

### **Common Window Functions:**
- ROW_NUMBER(), RANK(), DENSE_RANK()
- LAG(), LEAD()
- SUM(), AVG(), COUNT() OVER (...)
- FIRST_VALUE(), LAST_VALUE()

In [3]:
print("="*80)
print("ðŸªŸ 2. WINDOW FUNCTIONS")
print("="*80)

# A. Ranking Functions
print("\nðŸ“Š A. RANKING FUNCTIONS")
print("-" * 80)

result_rank = spark.sql("""
    SELECT 
        employee_id,
        name,
        department,
        salary,
        ROW_NUMBER() OVER (PARTITION BY department ORDER BY salary DESC) as row_num,
        RANK() OVER (PARTITION BY department ORDER BY salary DESC) as rank,
        DENSE_RANK() OVER (PARTITION BY department ORDER BY salary DESC) as dense_rank
    FROM employees
    WHERE status = 'Active'
    ORDER BY department, salary DESC
""")

print("Top 3 earners per department:")
result_rank.filter(col("row_num") <= 3).show(15)

print("""
ðŸ’¡ Difference:
   - ROW_NUMBER: 1, 2, 3, 4, 5 (unique)
   - RANK:       1, 2, 2, 4, 5 (skip after tie)
   - DENSE_RANK: 1, 2, 2, 3, 4 (no skip)
""")

================================================================================
ðŸªŸ 2. WINDOW FUNCTIONS
================================================================================

ðŸ“Š A. RANKING FUNCTIONS
--------------------------------------------------------------------------------
Top 3 earners per department:

+-----------+------------+-----------+------+-------+----+----------+
|employee_id|        name| department|salary|row_num|rank|dense_rank|
+-----------+------------+-----------+------+-------+----+----------+
|    EMP0322|Employee 322|Engineering|109070|      1|   1|         1|
|    EMP0338|Employee 338|Engineering|107167|      2|   2|         2|
|    EMP0323|Employee 323|Engineering|106531|      3|   3|         3|
|    EMP0446|Employee 446|    Finance|104748|      1|   1|         1|
|    EMP0203|Employee 203|    Finance|104252|      2|   2|         2|
|    EMP0339|Employee 339|    Finance|103886|      3|   3|         3|
|    EMP0493|Employee 493|         HR| 89950|      1|   1|         1|
|    EMP0213|Employee 213|         HR| 87834|      2|   2|         2|
|    EMP0411|Employee 411|         HR| 87120|      3|   3|         3|
|    EMP0397|Employee 397|  Marketing| 94545|      1|   1|         1|
|    EMP0200|Employee 200|  Marketing| 94533|      2|   2|         2|
|    EMP0126|Employee 126|  Marketing| 94230|      3|   3|         3|
|    EMP0247|Employee 247|      Sales| 99978|      1|   1|         1|
|    EMP0098| Employee 98|      Sales| 99825|      2|   2|         2|
|    EMP0256|Employee 256|      Sales| 97067|      3|   3|         3|
+-----------+------------+-----------+------+-------+----+----------+


ðŸ’¡ Difference:
   - ROW_NUMBER: 1, 2, 3, 4, 5 (unique)
   - RANK:       1, 2, 2, 4, 5 (skip after tie)
   - DENSE_RANK: 1, 2, 2, 3, 4 (no skip)

In [4]:
# B. LAG and LEAD
print("\nðŸ“Š B. LAG and LEAD (Compare with previous/next row)")
print("-" * 80)

result_lag_lead = spark.sql("""
    SELECT 
        employee_id,
        name,
        department,
        salary,
        LAG(salary, 1) OVER (PARTITION BY department ORDER BY salary) as prev_salary,
        LEAD(salary, 1) OVER (PARTITION BY department ORDER BY salary) as next_salary,
        salary - LAG(salary, 1) OVER (PARTITION BY department ORDER BY salary) as diff_from_prev
    FROM employees
    WHERE status = 'Active'
    ORDER BY department, salary
""")

result_lag_lead.show(10)

print("""
ðŸ’¡ LAG and LEAD:
   - LAG(col, n):  Get value from n rows BEFORE
   - LEAD(col, n): Get value from n rows AFTER
   - Useful for: Time series, comparing with previous/next
""")

ðŸ“Š B. LAG and LEAD (Compare with previous/next row)
--------------------------------------------------------------------------------
+-----------+------------+-----------+------+-----------+-----------+--------------+
|employee_id|        name| department|salary|prev_salary|next_salary|diff_from_prev|
+-----------+------------+-----------+------+-----------+-----------+--------------+
|    EMP0101|Employee 101|Engineering| 71279|       NULL|      71747|          NULL|
|    EMP0122|Employee 122|Engineering| 71747|      71279|      73136|           468|
|    EMP0369|Employee 369|Engineering| 73136|      71747|      73613|          1389|
|    EMP0489|Employee 489|Engineering| 73613|      73136|      75724|           477|
|    EMP0281|Employee 281|Engineering| 75724|      73613|      77262|          2111|
|    EMP0381|Employee 381|Engineering| 77262|      75724|      79116|          1538|
|    EMP0110|Employee 110|Engineering| 79116|      77262|      79542|          1854|
|    EMP0456|Employee 456|Engineering| 79542|      79116|      80719|           426|
|    EMP0267|Employee 267|Engineering| 80719|      79542|      81633|          1177|
|    EMP0227|Employee 227|Engineering| 81633|      80719|      81704|           914|
+-----------+------------+-----------+------+-----------+-----------+--------------+
only showing top 10 rows


ðŸ’¡ LAG and LEAD:
   - LAG(col, n):  Get value from n rows BEFORE
   - LEAD(col, n): Get value from n rows AFTER
   - Useful for: Time series, comparing with previous/next

In [5]:
# C. Running Totals and Moving Averages
print("\nðŸ“Š C. RUNNING TOTALS and MOVING AVERAGES")
print("-" * 80)

result_running = spark.sql("""
    SELECT 
        sale_date,
        amount,
        SUM(amount) OVER (ORDER BY sale_date) as running_total,
        AVG(amount) OVER (ORDER BY sale_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) as moving_avg_3,
        COUNT(*) OVER (ORDER BY sale_date) as cumulative_count
    FROM sales
    ORDER BY sale_date
""")

result_running.show(20)

print("""
ðŸ’¡ Window Frame:
   - ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
     â†’ Last 3 rows (including current)
   
   - ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
     â†’ All rows from start to current (running total)
   
   - ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
     â†’ Previous, current, and next row
""")

ðŸ“Š C. RUNNING TOTALS and MOVING AVERAGES
--------------------------------------------------------------------------------

26/01/11 15:44:42 WARN WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.
26/01/11 15:44:42 WARN WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.
26/01/11 15:44:42 WARN WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.
26/01/11 15:44:42 WARN WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.
26/01/11 15:44:42 WARN WindowExec: No Partition Defined for Window operation! Moving all data to a single partition, this can cause serious performance degradation.

+----------+------+-------------+------------------+----------------+
| sale_date|amount|running_total|      moving_avg_3|cumulative_count|
+----------+------+-------------+------------------+----------------+
|2024-01-01| 22472|       538931|           22472.0|              20|
|2024-01-01| 31633|       538931|           27052.5|              20|
|2024-01-01| 34789|       538931|29631.333333333332|              20|
|2024-01-01| 29017|       538931|           31813.0|              20|
|2024-01-01| 28487|       538931|30764.333333333332|              20|
|2024-01-01| 23666|       538931|27056.666666666668|              20|
|2024-01-01| 22697|       538931|           24950.0|              20|
|2024-01-01| 42407|       538931|           29590.0|              20|
|2024-01-01| 14777|       538931|           26627.0|              20|
|2024-01-01| 13785|       538931|23656.333333333332|              20|
|2024-01-01| 36268|       538931|           21610.0|              20|
|2024-01-01| 26194|       538931|25415.666666666668|              20|
|2024-01-01| 27640|       538931|           30034.0|              20|
|2024-01-01| 43232|       538931|32355.333333333332|              20|
|2024-01-01| 30325|       538931|33732.333333333336|              20|
|2024-01-01|  3292|       538931|25616.333333333332|              20|
|2024-01-01| 44338|       538931|           25985.0|              20|
|2024-01-01| 24982|       538931|           24204.0|              20|
|2024-01-01| 27929|       538931|32416.333333333332|              20|
|2024-01-01| 11001|       538931|           21304.0|              20|
+----------+------+-------------+------------------+----------------+
only showing top 20 rows


ðŸ’¡ Window Frame:
   - ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
     â†’ Last 3 rows (including current)

   - ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
     â†’ All rows from start to current (running total)

   - ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
     â†’ Previous, current, and next row

In [6]:
# D. FIRST_VALUE and LAST_VALUE
print("\nðŸ“Š D. FIRST_VALUE and LAST_VALUE")
print("-" * 80)

result_first_last = spark.sql("""
    SELECT 
        department,
        name,
        salary,
        FIRST_VALUE(name) OVER (PARTITION BY department ORDER BY salary DESC) as highest_paid,
        LAST_VALUE(name) OVER (PARTITION BY department ORDER BY salary DESC 
                               ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) as lowest_paid,
        FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY salary DESC) as max_salary,
        salary - FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY salary DESC) as diff_from_max
    FROM employees
    WHERE status = 'Active'
    ORDER BY department, salary DESC
""")

result_first_last.show(15)

print("""
ðŸ’¡ FIRST_VALUE and LAST_VALUE:
   - FIRST_VALUE: First value in window
   - LAST_VALUE: Last value in window
   - Need ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
     for LAST_VALUE to work correctly
""")

ðŸ“Š D. FIRST_VALUE and LAST_VALUE
--------------------------------------------------------------------------------
+-----------+------------+------+------------+------------+----------+-------------+
| department|        name|salary|highest_paid| lowest_paid|max_salary|diff_from_max|
+-----------+------------+------+------------+------------+----------+-------------+
|Engineering|Employee 322|109070|Employee 322|Employee 101|    109070|            0|
|Engineering|Employee 338|107167|Employee 322|Employee 101|    109070|        -1903|
|Engineering|Employee 323|106531|Employee 322|Employee 101|    109070|        -2539|
|Engineering|Employee 320|106428|Employee 322|Employee 101|    109070|        -2642|
|Engineering|Employee 180|106326|Employee 322|Employee 101|    109070|        -2744|
|Engineering| Employee 38|106167|Employee 322|Employee 101|    109070|        -2903|
|Engineering| Employee 64|104672|Employee 322|Employee 101|    109070|        -4398|
|Engineering|Employee 166|103831|Employee 322|Employee 101|    109070|        -5239|
|Engineering|Employee 270|103587|Employee 322|Employee 101|    109070|        -5483|
|Engineering|Employee 471|103462|Employee 322|Employee 101|    109070|        -5608|
|Engineering|Employee 453|103321|Employee 322|Employee 101|    109070|        -5749|
|Engineering|Employee 443|103161|Employee 322|Employee 101|    109070|        -5909|
|Engineering|Employee 104|102964|Employee 322|Employee 101|    109070|        -6106|
|Engineering|Employee 209|102950|Employee 322|Employee 101|    109070|        -6120|
|Engineering|Employee 354|102097|Employee 322|Employee 101|    109070|        -6973|
+-----------+------------+------+------------+------------+----------+-------------+
only showing top 15 rows


ðŸ’¡ FIRST_VALUE and LAST_VALUE:
   - FIRST_VALUE: First value in window
   - LAST_VALUE: Last value in window
   - Need ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
     for LAST_VALUE to work correctly

In [7]:
# E. NTILE
print("\nðŸ“Š E. NTILE (Divide into buckets)")
print("-" * 80)

result_ntile = spark.sql("""
    SELECT 
        employee_id,
        name,
        department,
        salary,
        NTILE(4) OVER (PARTITION BY department ORDER BY salary DESC) as quartile,
        CASE 
            WHEN NTILE(4) OVER (PARTITION BY department ORDER BY salary DESC) = 1 THEN 'Top 25%'
            WHEN NTILE(4) OVER (PARTITION BY department ORDER BY salary DESC) = 2 THEN 'Top 50%'
            WHEN NTILE(4) OVER (PARTITION BY department ORDER BY salary DESC) = 3 THEN 'Top 75%'
            ELSE 'Bottom 25%'
        END as salary_bracket
    FROM employees
    WHERE status = 'Active'
    ORDER BY department, salary DESC
""")

result_ntile.show(20)

print("""
ðŸ’¡ NTILE(n):
   - Divide rows into n buckets
   - NTILE(4) = Quartiles (4 buckets)
   - NTILE(10) = Deciles (10 buckets)
   - NTILE(100) = Percentiles (100 buckets)
""")

ðŸ“Š E. NTILE (Divide into buckets)
--------------------------------------------------------------------------------
+-----------+------------+-----------+------+--------+--------------+
|employee_id|        name| department|salary|quartile|salary_bracket|
+-----------+------------+-----------+------+--------+--------------+
|    EMP0322|Employee 322|Engineering|109070|       1|       Top 25%|
|    EMP0338|Employee 338|Engineering|107167|       1|       Top 25%|
|    EMP0323|Employee 323|Engineering|106531|       1|       Top 25%|
|    EMP0320|Employee 320|Engineering|106428|       1|       Top 25%|
|    EMP0180|Employee 180|Engineering|106326|       1|       Top 25%|
|    EMP0038| Employee 38|Engineering|106167|       1|       Top 25%|
|    EMP0064| Employee 64|Engineering|104672|       1|       Top 25%|
|    EMP0166|Employee 166|Engineering|103831|       1|       Top 25%|
|    EMP0270|Employee 270|Engineering|103587|       1|       Top 25%|
|    EMP0471|Employee 471|Engineering|103462|       1|       Top 25%|
|    EMP0453|Employee 453|Engineering|103321|       1|       Top 25%|
|    EMP0443|Employee 443|Engineering|103161|       1|       Top 25%|
|    EMP0104|Employee 104|Engineering|102964|       1|       Top 25%|
|    EMP0209|Employee 209|Engineering|102950|       1|       Top 25%|
|    EMP0354|Employee 354|Engineering|102097|       1|       Top 25%|
|    EMP0179|Employee 179|Engineering|102072|       1|       Top 25%|
|    EMP0243|Employee 243|Engineering|101986|       1|       Top 25%|
|    EMP0069| Employee 69|Engineering|101961|       1|       Top 25%|
|    EMP0378|Employee 378|Engineering|101648|       2|       Top 50%|
|    EMP0131|Employee 131|Engineering|100633|       2|       Top 50%|
+-----------+------------+-----------+------+--------+--------------+
only showing top 20 rows


ðŸ’¡ NTILE(n):
   - Divide rows into n buckets
   - NTILE(4) = Quartiles (4 buckets)
   - NTILE(10) = Deciles (10 buckets)
   - NTILE(100) = Percentiles (100 buckets)

In [8]:
# F. PERCENT_RANK
print("\nðŸ“Š F. PERCENT_RANK (Percentile)")
print("-" * 80)

result_percent = spark.sql("""
    SELECT 
        employee_id,
        name,
        department,
        salary,
        PERCENT_RANK() OVER (PARTITION BY department ORDER BY salary) as percentile,
        ROUND(PERCENT_RANK() OVER (PARTITION BY department ORDER BY salary) * 100, 2) as percentile_pct
    FROM employees
    WHERE status = 'Active'
    ORDER BY department, salary DESC
""")

result_percent.show(15)

print("""
ðŸ’¡ PERCENT_RANK():
   - Returns percentile (0.0 to 1.0)
   - 0.0 = lowest value
   - 1.0 = highest value
   - Multiply by 100 for percentage
""")

ðŸ“Š F. PERCENT_RANK (Percentile)
--------------------------------------------------------------------------------
+-----------+------------+-----------+------+------------------+--------------+
|employee_id|        name| department|salary|        percentile|percentile_pct|
+-----------+------------+-----------+------+------------------+--------------+
|    EMP0322|Employee 322|Engineering|109070|               1.0|         100.0|
|    EMP0338|Employee 338|Engineering|107167|0.9852941176470589|         98.53|
|    EMP0323|Employee 323|Engineering|106531|0.9705882352941176|         97.06|
|    EMP0320|Employee 320|Engineering|106428|0.9558823529411765|         95.59|
|    EMP0180|Employee 180|Engineering|106326|0.9411764705882353|         94.12|
|    EMP0038| Employee 38|Engineering|106167|0.9264705882352942|         92.65|
|    EMP0064| Employee 64|Engineering|104672|0.9117647058823529|         91.18|
|    EMP0166|Employee 166|Engineering|103831|0.8970588235294118|         89.71|
|    EMP0270|Employee 270|Engineering|103587|0.8823529411764706|         88.24|
|    EMP0471|Employee 471|Engineering|103462|0.8676470588235294|         86.76|
|    EMP0453|Employee 453|Engineering|103321|0.8529411764705882|         85.29|
|    EMP0443|Employee 443|Engineering|103161|0.8382352941176471|         83.82|
|    EMP0104|Employee 104|Engineering|102964|0.8235294117647058|         82.35|
|    EMP0209|Employee 209|Engineering|102950|0.8088235294117647|         80.88|
|    EMP0354|Employee 354|Engineering|102097|0.7941176470588235|         79.41|
+-----------+------------+-----------+------+------------------+--------------+
only showing top 15 rows


ðŸ’¡ PERCENT_RANK():
   - Returns percentile (0.0 to 1.0)
   - 0.0 = lowest value
   - 1.0 = highest value
   - Multiply by 100 for percentage

---

## ðŸ”— **3. COMPLEX JOINS**

In [9]:
print("="*80)
print("ðŸ”— 3. COMPLEX JOINS")
print("="*80)

# A. Self Join
print("\nðŸ“Š A. SELF JOIN (Employees and their managers)")
print("-" * 80)

result_self_join = spark.sql("""
    SELECT 
        e.employee_id,
        e.name as employee_name,
        e.department,
        e.salary as employee_salary,
        m.employee_id as manager_id,
        m.name as manager_name,
        m.salary as manager_salary
    FROM employees e
    LEFT JOIN employees m ON e.manager_id = m.employee_id
    WHERE e.status = 'Active'
    ORDER BY e.department, e.employee_id
""")

result_self_join.show(10)

print("""
ðŸ’¡ Self Join:
   - Join table with itself
   - Use aliases (e, m) to distinguish
   - Common use: Hierarchical data (employee-manager)
""")

================================================================================
ðŸ”— 3. COMPLEX JOINS
================================================================================

ðŸ“Š A. SELF JOIN (Employees and their managers)
--------------------------------------------------------------------------------
+-----------+-------------+-----------+---------------+----------+------------+--------------+
|employee_id|employee_name| department|employee_salary|manager_id|manager_name|manager_salary|
+-----------+-------------+-----------+---------------+----------+------------+--------------+
|    EMP0027|  Employee 27|Engineering|          85504|      NULL|        NULL|          NULL|
|    EMP0033|  Employee 33|Engineering|          90435|      NULL|        NULL|          NULL|
|    EMP0037|  Employee 37|Engineering|          88755|      NULL|        NULL|          NULL|
|    EMP0038|  Employee 38|Engineering|         106167|      NULL|        NULL|          NULL|
|    EMP0040|  Employee 40|Engineering|          98947|      NULL|        NULL|          NULL|
|    EMP0048|  Employee 48|Engineering|          99595|      NULL|        NULL|          NULL|
|    EMP0052|  Employee 52|Engineering|          81918|   EMP0021| Employee 21|        100352|
|    EMP0061|  Employee 61|Engineering|         100139|   EMP0047| Employee 47|        102179|
|    EMP0064|  Employee 64|Engineering|         104672|   EMP0016| Employee 16|         87283|
|    EMP0069|  Employee 69|Engineering|         101961|   EMP0025| Employee 25|         90013|
+-----------+-------------+-----------+---------------+----------+------------+--------------+
only showing top 10 rows


ðŸ’¡ Self Join:
   - Join table with itself
   - Use aliases (e, m) to distinguish
   - Common use: Hierarchical data (employee-manager)

In [10]:
# B. Employees earning more than manager
print("\nðŸ“Š B. Employees earning more than their manager")
print("-" * 80)

result_higher_salary = spark.sql("""
    SELECT 
        e.employee_id,
        e.name as employee_name,
        e.salary as employee_salary,
        m.name as manager_name,
        m.salary as manager_salary,
        e.salary - m.salary as salary_diff
    FROM employees e
    INNER JOIN employees m ON e.manager_id = m.employee_id
    WHERE e.salary > m.salary
    ORDER BY salary_diff DESC
""")

result_higher_salary.show(10)

ðŸ“Š B. Employees earning more than their manager
--------------------------------------------------------------------------------
+-----------+-------------+---------------+------------+--------------+-----------+
|employee_id|employee_name|employee_salary|manager_name|manager_salary|salary_diff|
+-----------+-------------+---------------+------------+--------------+-----------+
|    EMP0322| Employee 322|         109070| Employee 36|         59643|      49427|
|    EMP0240| Employee 240|         107751| Employee 22|         59347|      48404|
|    EMP0338| Employee 338|         107167|  Employee 4|         60074|      47093|
|    EMP0320| Employee 320|         106428|  Employee 4|         60074|      46354|
|    EMP0179| Employee 179|         102072| Employee 22|         59347|      42725|
|    EMP0247| Employee 247|          99978| Employee 22|         59347|      40631|
|    EMP0166| Employee 166|         103831| Employee 50|         63660|      40171|
|    EMP0346| Employee 346|          99723| Employee 35|         59740|      39983|
|    EMP0465| Employee 465|          98473|  Employee 4|         60074|      38399|
|    EMP0256| Employee 256|          97067| Employee 22|         59347|      37720|
+-----------+-------------+---------------+------------+--------------+-----------+
only showing top 10 rows

In [11]:
# C. Cross Join
print("\nðŸ“Š C. CROSS JOIN (Cartesian product)")
print("-" * 80)

# Create small lookup table
categories = spark.createDataFrame([
    ("Category A",),
    ("Category B",),
    ("Category C",)
], ["category"])

categories.createOrReplaceTempView("categories")

result_cross = spark.sql("""
    SELECT 
        d.department,
        c.category
    FROM (SELECT DISTINCT department FROM employees) d
    CROSS JOIN categories c
    ORDER BY d.department, c.category
""")

print("All combinations of departments and categories:")
result_cross.show()

print("""
ðŸ’¡ Cross Join:
   - Cartesian product (all combinations)
   - Result size = table1_rows Ã— table2_rows
   - âš ï¸  Use carefully! Can be very large
   - Use case: Generate all combinations
""")

ðŸ“Š C. CROSS JOIN (Cartesian product)
--------------------------------------------------------------------------------
All combinations of departments and categories:
+-----------+----------+
| department|  category|
+-----------+----------+
|Engineering|Category A|
|Engineering|Category B|
|Engineering|Category C|
|    Finance|Category A|
|    Finance|Category B|
|    Finance|Category C|
|         HR|Category A|
|         HR|Category B|
|         HR|Category C|
|  Marketing|Category A|
|  Marketing|Category B|
|  Marketing|Category C|
|      Sales|Category A|
|      Sales|Category B|
|      Sales|Category C|
+-----------+----------+


ðŸ’¡ Cross Join:
   - Cartesian product (all combinations)
   - Result size = table1_rows Ã— table2_rows
   - âš ï¸  Use carefully! Can be very large
   - Use case: Generate all combinations

In [12]:
# D. Multiple Joins
print("\nðŸ“Š D. MULTIPLE JOINS")
print("-" * 80)

result_multiple = spark.sql("""
    SELECT 
        e.employee_id,
        e.name,
        e.department,
        e.salary,
        COUNT(s.sale_id) as total_sales,
        COALESCE(SUM(s.amount), 0) as total_revenue,
        m.name as manager_name
    FROM employees e
    LEFT JOIN sales s ON e.employee_id = s.employee_id
    LEFT JOIN employees m ON e.manager_id = m.employee_id
    WHERE e.status = 'Active'
    GROUP BY e.employee_id, e.name, e.department, e.salary, m.name
    ORDER BY total_revenue DESC
""")

result_multiple.show(10)

print("""
ðŸ’¡ Multiple Joins:
   - Join multiple tables in one query
   - Use LEFT JOIN to keep all employees (even without sales)
   - Use COALESCE to handle NULLs
""")

ðŸ“Š D. MULTIPLE JOINS
--------------------------------------------------------------------------------
+-----------+-----------+-----------+------+-----------+-------------+------------+
|employee_id|       name| department|salary|total_sales|total_revenue|manager_name|
+-----------+-----------+-----------+------+-----------+-------------+------------+
|    EMP0078|Employee 78|      Sales| 64876|          8|       318770|  Employee 8|
|    EMP0033|Employee 33|Engineering| 90435|          8|       223157|        NULL|
|    EMP0013|Employee 13|      Sales| 90946|          7|       214662|        NULL|
|    EMP0060|Employee 60|  Marketing| 66665|          8|       211087| Employee 38|
|    EMP0032|Employee 32|  Marketing| 88322|          7|       205087|        NULL|
|    EMP0057|Employee 57|    Finance| 92738|          7|       202772| Employee 43|
|    EMP0056|Employee 56|  Marketing| 89386|          6|       202474|  Employee 9|
|    EMP0018|Employee 18|      Sales| 88504|          7|       196280|        NULL|
|    EMP0045|Employee 45|    Finance| 78590|          6|       191146|        NULL|
|    EMP0028|Employee 28|      Sales| 88537|          8|       187786|        NULL|
+-----------+-----------+-----------+------+-----------+-------------+------------+
only showing top 10 rows


ðŸ’¡ Multiple Joins:
   - Join multiple tables in one query
   - Use LEFT JOIN to keep all employees (even without sales)
   - Use COALESCE to handle NULLs

---

## ðŸ”€ **4. SET OPERATIONS**

### **Set Operations:**
- **UNION**: Combine results (remove duplicates)
- **UNION ALL**: Combine results (keep duplicates)
- **INTERSECT**: Common rows
- **EXCEPT**: Rows in first but not in second

In [13]:
print("="*80)
print("ðŸ”€ 4. SET OPERATIONS")
print("="*80)

# A. UNION
print("\nðŸ“Š A. UNION (Combine results)")
print("-" * 80)

result_union = spark.sql("""
    SELECT employee_id, name, 'High Earner' as category
    FROM employees
    WHERE salary > 85000
    
    UNION
    
    SELECT employee_id, name, 'Young Employee' as category
    FROM employees
    WHERE age < 30
    
    ORDER BY employee_id
""")

result_union.show(10)

================================================================================
ðŸ”€ 4. SET OPERATIONS
================================================================================

ðŸ“Š A. UNION (Combine results)
--------------------------------------------------------------------------------
+-----------+-----------+--------------+
|employee_id|       name|      category|
+-----------+-----------+--------------+
|    EMP0003| Employee 3|Young Employee|
|    EMP0005| Employee 5|   High Earner|
|    EMP0007| Employee 7|   High Earner|
|    EMP0008| Employee 8|   High Earner|
|    EMP0009| Employee 9|   High Earner|
|    EMP0012|Employee 12|   High Earner|
|    EMP0012|Employee 12|Young Employee|
|    EMP0013|Employee 13|   High Earner|
|    EMP0014|Employee 14|   High Earner|
|    EMP0015|Employee 15|   High Earner|
+-----------+-----------+--------------+
only showing top 10 rows

In [14]:
# B. UNION ALL
print("\nðŸ“Š B. UNION ALL (Keep duplicates)")
print("-" * 80)

result_union_all = spark.sql("""
    SELECT employee_id, name, 'High Earner' as category
    FROM employees
    WHERE salary > 85000
    
    UNION ALL
    
    SELECT employee_id, name, 'Young Employee' as category
    FROM employees
    WHERE age < 30
    
    ORDER BY employee_id
""")

print(f"UNION result: {result_union.count()} rows (duplicates removed)")
print(f"UNION ALL result: {result_union_all.count()} rows (duplicates kept)")
result_union_all.show(10)

ðŸ“Š B. UNION ALL (Keep duplicates)
--------------------------------------------------------------------------------
UNION result: 318 rows (duplicates removed)
UNION ALL result: 318 rows (duplicates kept)
+-----------+-----------+--------------+
|employee_id|       name|      category|
+-----------+-----------+--------------+
|    EMP0003| Employee 3|Young Employee|
|    EMP0005| Employee 5|   High Earner|
|    EMP0007| Employee 7|   High Earner|
|    EMP0008| Employee 8|   High Earner|
|    EMP0009| Employee 9|   High Earner|
|    EMP0012|Employee 12|Young Employee|
|    EMP0012|Employee 12|   High Earner|
|    EMP0013|Employee 13|   High Earner|
|    EMP0014|Employee 14|   High Earner|
|    EMP0015|Employee 15|   High Earner|
+-----------+-----------+--------------+
only showing top 10 rows

In [15]:
# C. INTERSECT
print("\nðŸ“Š C. INTERSECT (Common rows)")
print("-" * 80)

result_intersect = spark.sql("""
    SELECT employee_id, name
    FROM employees
    WHERE salary > 80000
    
    INTERSECT
    
    SELECT employee_id, name
    FROM employees
    WHERE age < 35
""")

print("Employees who are both high earners AND young:")
result_intersect.show(10)

ðŸ“Š C. INTERSECT (Common rows)
--------------------------------------------------------------------------------
Employees who are both high earners AND young:
+-----------+------------+
|employee_id|        name|
+-----------+------------+
|    EMP0392|Employee 392|
|    EMP0455|Employee 455|
|    EMP0409|Employee 409|
|    EMP0423|Employee 423|
|    EMP0319|Employee 319|
|    EMP0149|Employee 149|
|    EMP0170|Employee 170|
|    EMP0362|Employee 362|
|    EMP0118|Employee 118|
|    EMP0396|Employee 396|
+-----------+------------+
only showing top 10 rows

In [16]:
# D. EXCEPT
print("\nðŸ“Š D. EXCEPT (Difference)")
print("-" * 80)

result_except = spark.sql("""
    SELECT employee_id, name, salary
    FROM employees
    WHERE department = 'Engineering'
    
    EXCEPT
    
    SELECT employee_id, name, salary
    FROM employees
    WHERE salary > 85000
""")

print("Engineering employees who are NOT high earners:")
result_except.show(10)

print("""
ðŸ’¡ Set Operations Summary:
   - UNION: A âˆª B (remove duplicates)
   - UNION ALL: A + B (keep duplicates)
   - INTERSECT: A âˆ© B (common)
   - EXCEPT: A - B (difference)
   
   âš ï¸  All queries must have same number of columns and types
""")

ðŸ“Š D. EXCEPT (Difference)
--------------------------------------------------------------------------------
Engineering employees who are NOT high earners:
+-----------+------------+------+
|employee_id|        name|salary|
+-----------+------------+------+
|    EMP0052| Employee 52| 81918|
|    EMP0215|Employee 215| 82603|
|    EMP0197|Employee 197| 81704|
|    EMP0122|Employee 122| 71747|
|    EMP0227|Employee 227| 81633|
|    EMP0235|Employee 235| 76550|
|    EMP0080| Employee 80| 75704|
|    EMP0121|Employee 121| 70183|
|    EMP0110|Employee 110| 79116|
|    EMP0142|Employee 142| 84455|
+-----------+------------+------+
only showing top 10 rows


ðŸ’¡ Set Operations Summary:
   - UNION: A âˆª B (remove duplicates)
   - UNION ALL: A + B (keep duplicates)
   - INTERSECT: A âˆ© B (common)
   - EXCEPT: A - B (difference)

   âš ï¸  All queries must have same number of columns and types

---

## ðŸ”„ **5. PIVOT & UNPIVOT**

In [17]:
print("="*80)
print("ðŸ”„ 5. PIVOT & UNPIVOT")
print("="*80)

# A. PIVOT
print("\nðŸ“Š A. PIVOT (Transform rows to columns)")
print("-" * 80)

print("Original data (long format):")
spark.sql("""
    SELECT department, country, COUNT(*) as employee_count
    FROM employees
    GROUP BY department, country
    ORDER BY department, country
""").show(10)

print("\nPivoted data (wide format):")
result_pivot = spark.sql("""
    SELECT * FROM (
        SELECT department, country, salary
        FROM employees
    )
    PIVOT (
        COUNT(*) as count,
        ROUND(AVG(salary), 2) as avg_salary
        FOR country IN ('USA', 'UK', 'Germany', 'France', 'Canada')
    )
    ORDER BY department
""")

result_pivot.show()

print("""
ðŸ’¡ PIVOT:
   - Transform rows to columns
   - Syntax: PIVOT (agg_func FOR column IN (values))
   - Useful for: Reports, dashboards
   - Long format â†’ Wide format
""")

================================================================================
ðŸ”„ 5. PIVOT & UNPIVOT
================================================================================

ðŸ“Š A. PIVOT (Transform rows to columns)
--------------------------------------------------------------------------------
Original data (long format):
+-----------+-------+--------------+
| department|country|employee_count|
+-----------+-------+--------------+
|Engineering| Canada|            19|
|Engineering| France|            22|
|Engineering|Germany|            13|
|Engineering|     UK|            19|
|Engineering|    USA|            26|
|    Finance| Canada|            26|
|    Finance| France|            30|
|    Finance|Germany|            15|
|    Finance|     UK|            17|
|    Finance|    USA|            15|
+-----------+-------+--------------+
only showing top 10 rows


Pivoted data (wide format):
+-----------+---------+--------------+--------+-------------+-------------+------------------+------------+-----------------+------------+-----------------+
| department|USA_count|USA_avg_salary|UK_count|UK_avg_salary|Germany_count|Germany_avg_salary|France_count|France_avg_salary|Canada_count|Canada_avg_salary|
+-----------+---------+--------------+--------+-------------+-------------+------------------+------------+-----------------+------------+-----------------+
|Engineering|       26|      87948.96|      19|     90710.79|           13|          91025.77|          22|          92605.5|          19|         94731.95|
|    Finance|       15|       81691.0|      17|     84926.47|           15|           82742.6|          30|         83490.47|          26|         85838.42|
|         HR|       13|      68408.08|      18|     74094.78|           21|          71282.48|          22|         67404.68|          15|         68777.53|
|  Marketing|       32|      73564.09|      15|     73648.73|           19|          77102.05|          14|         79742.36|          21|         78678.05|
|      Sales|       20|       75284.1|      27|      81081.3|           24|          82575.08|          19|         82376.79|          18|         79396.67|
+-----------+---------+--------------+--------+-------------+-------------+------------------+------------+-----------------+------------+-----------------+


ðŸ’¡ PIVOT:
   - Transform rows to columns
   - Syntax: PIVOT (agg_func FOR column IN (values))
   - Useful for: Reports, dashboards
   - Long format â†’ Wide format

In [18]:
# B. PIVOT using CASE WHEN
print("\nðŸ“Š B. PIVOT using CASE WHEN (more flexible)")
print("-" * 80)

result_pivot_case = spark.sql("""
    SELECT 
        department,
        COUNT(*) as total_employees,
        SUM(CASE WHEN country = 'USA' THEN 1 ELSE 0 END) as usa_count,
        SUM(CASE WHEN country = 'UK' THEN 1 ELSE 0 END) as uk_count,
        SUM(CASE WHEN country = 'Germany' THEN 1 ELSE 0 END) as germany_count,
        SUM(CASE WHEN country = 'France' THEN 1 ELSE 0 END) as france_count,
        SUM(CASE WHEN country = 'Canada' THEN 1 ELSE 0 END) as canada_count,
        ROUND(AVG(CASE WHEN country = 'USA' THEN salary END), 2) as usa_avg_salary,
        ROUND(AVG(CASE WHEN country = 'UK' THEN salary END), 2) as uk_avg_salary
    FROM employees
    GROUP BY department
    ORDER BY department
""")

result_pivot_case.show()

print("""
ðŸ’¡ PIVOT with CASE WHEN:
   - More flexible than PIVOT
   - Can use any condition
   - Can mix different aggregations
   - Easier to understand
""")

ðŸ“Š B. PIVOT using CASE WHEN (more flexible)
--------------------------------------------------------------------------------
+-----------+---------------+---------+--------+-------------+------------+------------+--------------+-------------+
| department|total_employees|usa_count|uk_count|germany_count|france_count|canada_count|usa_avg_salary|uk_avg_salary|
+-----------+---------------+---------+--------+-------------+------------+------------+--------------+-------------+
|Engineering|             99|       26|      19|           13|          22|          19|      87948.96|     90710.79|
|    Finance|            103|       15|      17|           15|          30|          26|       81691.0|     84926.47|
|         HR|             89|       13|      18|           21|          22|          15|      68408.08|     74094.78|
|  Marketing|            101|       32|      15|           19|          14|          21|      73564.09|     73648.73|
|      Sales|            108|       20|      27|           24|          19|          18|       75284.1|      81081.3|
+-----------+---------------+---------+--------+-------------+------------+------------+--------------+-------------+


ðŸ’¡ PIVOT with CASE WHEN:
   - More flexible than PIVOT
   - Can use any condition
   - Can mix different aggregations
   - Easier to understand

In [19]:
# C. UNPIVOT
print("\nðŸ“Š C. UNPIVOT (Transform columns to rows)")
print("-" * 80)

# First create a pivoted table
pivoted = spark.sql("""
    SELECT 
        department,
        SUM(CASE WHEN country = 'USA' THEN 1 ELSE 0 END) as USA,
        SUM(CASE WHEN country = 'UK' THEN 1 ELSE 0 END) as UK,
        SUM(CASE WHEN country = 'Germany' THEN 1 ELSE 0 END) as Germany
    FROM employees
    GROUP BY department
""")

pivoted.createOrReplaceTempView("pivoted_data")

print("Pivoted data (wide format):")
pivoted.show()

print("\nUnpivoted data (long format):")
result_unpivot = spark.sql("""
    SELECT department, country, employee_count
    FROM pivoted_data
    LATERAL VIEW STACK(3,
        'USA', USA,
        'UK', UK,
        'Germany', Germany
    ) AS country, employee_count
    ORDER BY department, country
""")

result_unpivot.show()

print("""
ðŸ’¡ UNPIVOT:
   - Transform columns to rows
   - Use LATERAL VIEW STACK
   - Wide format â†’ Long format
   - Useful for: Normalizing data
""")

ðŸ“Š C. UNPIVOT (Transform columns to rows)
--------------------------------------------------------------------------------
Pivoted data (wide format):
+-----------+---+---+-------+
| department|USA| UK|Germany|
+-----------+---+---+-------+
|      Sales| 20| 27|     24|
|Engineering| 26| 19|     13|
|         HR| 13| 18|     21|
|    Finance| 15| 17|     15|
|  Marketing| 32| 15|     19|
+-----------+---+---+-------+


Unpivoted data (long format):
+-----------+-------+--------------+
| department|country|employee_count|
+-----------+-------+--------------+
|Engineering|Germany|            13|
|Engineering|     UK|            19|
|Engineering|    USA|            26|
|    Finance|Germany|            15|
|    Finance|     UK|            17|
|    Finance|    USA|            15|
|         HR|Germany|            21|
|         HR|     UK|            18|
|         HR|    USA|            13|
|  Marketing|Germany|            19|
|  Marketing|     UK|            15|
|  Marketing|    USA|            32|
|      Sales|Germany|            24|
|      Sales|     UK|            27|
|      Sales|    USA|            20|
+-----------+-------+--------------+


ðŸ’¡ UNPIVOT:
   - Transform columns to rows
   - Use LATERAL VIEW STACK
   - Wide format â†’ Long format
   - Useful for: Normalizing data

---

## ðŸ“ˆ **6. ADVANCED AGGREGATIONS**

In [20]:
print("="*80)
print("ðŸ“ˆ 6. ADVANCED AGGREGATIONS")
print("="*80)

# A. GROUPING SETS
print("\nðŸ“Š A. GROUPING SETS (Multiple GROUP BY in one query)")
print("-" * 80)

result_grouping_sets = spark.sql("""
    SELECT 
        department,
        country,
        COUNT(*) as employee_count,
        ROUND(AVG(salary), 2) as avg_salary
    FROM employees
    WHERE status = 'Active'
    GROUP BY GROUPING SETS (
        (department, country),
        (department),
        (country),
        ()
    )
    ORDER BY department NULLS LAST, country NULLS LAST
""")

result_grouping_sets.show(30)

print("""
ðŸ’¡ GROUPING SETS:
   - Multiple GROUP BY in one query
   - More efficient than UNION
   - NULL means "all" (subtotal/grand total)
""")

================================================================================
ðŸ“ˆ 6. ADVANCED AGGREGATIONS
================================================================================

ðŸ“Š A. GROUPING SETS (Multiple GROUP BY in one query)
--------------------------------------------------------------------------------
+-----------+-------+--------------+----------+
| department|country|employee_count|avg_salary|
+-----------+-------+--------------+----------+
|Engineering| Canada|            16|  95807.94|
|Engineering| France|            15|  92900.27|
|Engineering|Germany|             9|  91312.56|
|Engineering|     UK|            13|  95112.15|
|Engineering|    USA|            16|  88251.63|
|Engineering|   NULL|            69|   92706.2|
|    Finance| Canada|            23|   84621.0|
|    Finance| France|            25|   83208.4|
|    Finance|Germany|            11|  78902.27|
|    Finance|     UK|            11|  88459.09|
|    Finance|    USA|            14|  81014.43|
|    Finance|   NULL|            84|  83353.21|
|         HR| Canada|            10|   68230.9|
|         HR| France|            13|  63171.69|
|         HR|Germany|            18|  73553.28|
|         HR|     UK|            15|  72554.53|
|         HR|    USA|            12|  67122.83|
|         HR|   NULL|            68|  69430.76|
|  Marketing| Canada|            16|  78761.44|
|  Marketing| France|            10|   81676.5|
|  Marketing|Germany|            17|  76746.76|
|  Marketing|     UK|            11|  71680.55|
|  Marketing|    USA|            22|  73450.77|
|  Marketing|   NULL|            76|  76132.18|
|      Sales| Canada|            15|   78152.4|
|      Sales| France|            12|  80928.58|
|      Sales|Germany|            18|  85533.06|
|      Sales|     UK|            18|  81241.56|
|      Sales|    USA|            16|  75751.13|
|      Sales|   NULL|            79|  80473.29|
+-----------+-------+--------------+----------+
only showing top 30 rows


ðŸ’¡ GROUPING SETS:
   - Multiple GROUP BY in one query
   - More efficient than UNION
   - NULL means "all" (subtotal/grand total)

In [21]:
# B. ROLLUP
print("\nðŸ“Š B. ROLLUP (Hierarchical subtotals)")
print("-" * 80)

result_rollup = spark.sql("""
    SELECT 
        department,
        country,
        COUNT(*) as employee_count,
        ROUND(AVG(salary), 2) as avg_salary,
        ROUND(SUM(salary), 2) as total_salary
    FROM employees
    WHERE status = 'Active'
    GROUP BY ROLLUP(department, country)
    ORDER BY department NULLS LAST, country NULLS LAST
""")

result_rollup.show(30)

print("""
ðŸ’¡ ROLLUP:
   - Hierarchical aggregation
   - ROLLUP(A, B) creates:
     * (A, B) - Detail level
     * (A)    - Subtotal by A
     * ()     - Grand total
   - Useful for: Reports with subtotals
""")

ðŸ“Š B. ROLLUP (Hierarchical subtotals)
--------------------------------------------------------------------------------
+-----------+-------+--------------+----------+------------+
| department|country|employee_count|avg_salary|total_salary|
+-----------+-------+--------------+----------+------------+
|Engineering| Canada|            16|  95807.94|     1532927|
|Engineering| France|            15|  92900.27|     1393504|
|Engineering|Germany|             9|  91312.56|      821813|
|Engineering|     UK|            13|  95112.15|     1236458|
|Engineering|    USA|            16|  88251.63|     1412026|
|Engineering|   NULL|            69|   92706.2|     6396728|
|    Finance| Canada|            23|   84621.0|     1946283|
|    Finance| France|            25|   83208.4|     2080210|
|    Finance|Germany|            11|  78902.27|      867925|
|    Finance|     UK|            11|  88459.09|      973050|
|    Finance|    USA|            14|  81014.43|     1134202|
|    Finance|   NULL|            84|  83353.21|     7001670|
|         HR| Canada|            10|   68230.9|      682309|
|         HR| France|            13|  63171.69|      821232|
|         HR|Germany|            18|  73553.28|     1323959|
|         HR|     UK|            15|  72554.53|     1088318|
|         HR|    USA|            12|  67122.83|      805474|
|         HR|   NULL|            68|  69430.76|     4721292|
|  Marketing| Canada|            16|  78761.44|     1260183|
|  Marketing| France|            10|   81676.5|      816765|
|  Marketing|Germany|            17|  76746.76|     1304695|
|  Marketing|     UK|            11|  71680.55|      788486|
|  Marketing|    USA|            22|  73450.77|     1615917|
|  Marketing|   NULL|            76|  76132.18|     5786046|
|      Sales| Canada|            15|   78152.4|     1172286|
|      Sales| France|            12|  80928.58|      971143|
|      Sales|Germany|            18|  85533.06|     1539595|
|      Sales|     UK|            18|  81241.56|     1462348|
|      Sales|    USA|            16|  75751.13|     1212018|
|      Sales|   NULL|            79|  80473.29|     6357390|
+-----------+-------+--------------+----------+------------+
only showing top 30 rows


ðŸ’¡ ROLLUP:
   - Hierarchical aggregation
   - ROLLUP(A, B) creates:
     * (A, B) - Detail level
     * (A)    - Subtotal by A
     * ()     - Grand total
   - Useful for: Reports with subtotals

In [22]:
# C. CUBE
print("\nðŸ“Š C. CUBE (All combinations)")
print("-" * 80)

result_cube = spark.sql("""
    SELECT 
        department,
        country,
        COUNT(*) as employee_count,
        ROUND(AVG(salary), 2) as avg_salary
    FROM employees
    WHERE status = 'Active'
    GROUP BY CUBE(department, country)
    ORDER BY department NULLS LAST, country NULLS LAST
""")

result_cube.show(40)

print("""
ðŸ’¡ CUBE:
   - All possible combinations
   - CUBE(A, B) creates:
     * (A, B) - Both
     * (A)    - A only
     * (B)    - B only
     * ()     - Grand total
   - More combinations than ROLLUP
""")

ðŸ“Š C. CUBE (All combinations)
--------------------------------------------------------------------------------
+-----------+-------+--------------+----------+
| department|country|employee_count|avg_salary|
+-----------+-------+--------------+----------+
|Engineering| Canada|            16|  95807.94|
|Engineering| France|            15|  92900.27|
|Engineering|Germany|             9|  91312.56|
|Engineering|     UK|            13|  95112.15|
|Engineering|    USA|            16|  88251.63|
|Engineering|   NULL|            69|   92706.2|
|    Finance| Canada|            23|   84621.0|
|    Finance| France|            25|   83208.4|
|    Finance|Germany|            11|  78902.27|
|    Finance|     UK|            11|  88459.09|
|    Finance|    USA|            14|  81014.43|
|    Finance|   NULL|            84|  83353.21|
|         HR| Canada|            10|   68230.9|
|         HR| France|            13|  63171.69|
|         HR|Germany|            18|  73553.28|
|         HR|     UK|            15|  72554.53|
|         HR|    USA|            12|  67122.83|
|         HR|   NULL|            68|  69430.76|
|  Marketing| Canada|            16|  78761.44|
|  Marketing| France|            10|   81676.5|
|  Marketing|Germany|            17|  76746.76|
|  Marketing|     UK|            11|  71680.55|
|  Marketing|    USA|            22|  73450.77|
|  Marketing|   NULL|            76|  76132.18|
|      Sales| Canada|            15|   78152.4|
|      Sales| France|            12|  80928.58|
|      Sales|Germany|            18|  85533.06|
|      Sales|     UK|            18|  81241.56|
|      Sales|    USA|            16|  75751.13|
|      Sales|   NULL|            79|  80473.29|
|       NULL| Canada|            80|  82424.85|
|       NULL| France|            75|  81104.72|
|       NULL|Germany|            73|   80246.4|
|       NULL|     UK|            68|  81597.94|
|       NULL|    USA|            80|  77245.46|
|       NULL|   NULL|           376|  80487.04|
+-----------+-------+--------------+----------+


ðŸ’¡ CUBE:
   - All possible combinations
   - CUBE(A, B) creates:
     * (A, B) - Both
     * (A)    - A only
     * (B)    - B only
     * ()     - Grand total
   - More combinations than ROLLUP

In [23]:
# D. GROUPING function
print("\nðŸ“Š D. GROUPING function (Identify subtotal rows)")
print("-" * 80)

result_grouping = spark.sql("""
    SELECT 
        department,
        country,
        COUNT(*) as employee_count,
        ROUND(AVG(salary), 2) as avg_salary,
        GROUPING(department) as is_dept_total,
        GROUPING(country) as is_country_total,
        CASE 
            WHEN GROUPING(department) = 1 AND GROUPING(country) = 1 THEN 'Grand Total'
            WHEN GROUPING(department) = 1 THEN 'Country Total'
            WHEN GROUPING(country) = 1 THEN 'Department Total'
            ELSE 'Detail'
        END as level
    FROM employees
    WHERE status = 'Active'
    GROUP BY ROLLUP(department, country)
    ORDER BY department NULLS LAST, country NULLS LAST
""")

result_grouping.show(30)

print("""
ðŸ’¡ GROUPING function:
   - Returns 1 if column is aggregated (NULL is subtotal)
   - Returns 0 if column is not aggregated (NULL is real NULL)
   - Useful for: Identifying subtotal rows
""")

ðŸ“Š D. GROUPING function (Identify subtotal rows)
--------------------------------------------------------------------------------
+-----------+-------+--------------+----------+-------------+----------------+----------------+
| department|country|employee_count|avg_salary|is_dept_total|is_country_total|           level|
+-----------+-------+--------------+----------+-------------+----------------+----------------+
|Engineering| Canada|            16|  95807.94|            0|               0|          Detail|
|Engineering| France|            15|  92900.27|            0|               0|          Detail|
|Engineering|Germany|             9|  91312.56|            0|               0|          Detail|
|Engineering|     UK|            13|  95112.15|            0|               0|          Detail|
|Engineering|    USA|            16|  88251.63|            0|               0|          Detail|
|Engineering|   NULL|            69|   92706.2|            0|               1|Department Total|
|    Finance| Canada|            23|   84621.0|            0|               0|          Detail|
|    Finance| France|            25|   83208.4|            0|               0|          Detail|
|    Finance|Germany|            11|  78902.27|            0|               0|          Detail|
|    Finance|     UK|            11|  88459.09|            0|               0|          Detail|
|    Finance|    USA|            14|  81014.43|            0|               0|          Detail|
|    Finance|   NULL|            84|  83353.21|            0|               1|Department Total|
|         HR| Canada|            10|   68230.9|            0|               0|          Detail|
|         HR| France|            13|  63171.69|            0|               0|          Detail|
|         HR|Germany|            18|  73553.28|            0|               0|          Detail|
|         HR|     UK|            15|  72554.53|            0|               0|          Detail|
|         HR|    USA|            12|  67122.83|            0|               0|          Detail|
|         HR|   NULL|            68|  69430.76|            0|               1|Department Total|
|  Marketing| Canada|            16|  78761.44|            0|               0|          Detail|
|  Marketing| France|            10|   81676.5|            0|               0|          Detail|
|  Marketing|Germany|            17|  76746.76|            0|               0|          Detail|
|  Marketing|     UK|            11|  71680.55|            0|               0|          Detail|
|  Marketing|    USA|            22|  73450.77|            0|               0|          Detail|
|  Marketing|   NULL|            76|  76132.18|            0|               1|Department Total|
|      Sales| Canada|            15|   78152.4|            0|               0|          Detail|
|      Sales| France|            12|  80928.58|            0|               0|          Detail|
|      Sales|Germany|            18|  85533.06|            0|               0|          Detail|
|      Sales|     UK|            18|  81241.56|            0|               0|          Detail|
|      Sales|    USA|            16|  75751.13|            0|               0|          Detail|
|      Sales|   NULL|            79|  80473.29|            0|               1|Department Total|
+-----------+-------+--------------+----------+-------------+----------------+----------------+
only showing top 30 rows


ðŸ’¡ GROUPING function:
   - Returns 1 if column is aggregated (NULL is subtotal)
   - Returns 0 if column is not aggregated (NULL is real NULL)
   - Useful for: Identifying subtotal rows

---

## âš¡ **7. PERFORMANCE TIPS**

In [24]:
print("="*80)
print("âš¡ 7. SQL PERFORMANCE TIPS")
print("="*80)

print("""
ðŸ’¡ PERFORMANCE TIPS:

1. FILTER EARLY (Predicate Pushdown)
   âœ… Good:
      SELECT * FROM large_table
      WHERE date = '2024-01-01'
      
   âŒ Bad:
      SELECT * FROM (
          SELECT * FROM large_table
      ) WHERE date = '2024-01-01'

2. SELECT ONLY NEEDED COLUMNS (Column Pruning)
   âœ… Good:
      SELECT id, name, salary FROM employees
      
   âŒ Bad:
      SELECT * FROM employees

3. USE BROADCAST JOIN for small tables
   âœ… Good:
      SELECT /*+ BROADCAST(small_table) */
      FROM large_table JOIN small_table
      
4. AVOID CROSS JOIN
   âŒ Bad:
      SELECT * FROM table1 CROSS JOIN table2
      
   âœ… Good:
      SELECT * FROM table1 JOIN table2 ON table1.id = table2.id

5. USE WINDOW FUNCTIONS instead of self-joins
   âœ… Good:
      SELECT *, ROW_NUMBER() OVER (PARTITION BY dept ORDER BY salary DESC)
      
   âŒ Bad:
      SELECT * FROM employees e1
      WHERE (SELECT COUNT(*) FROM employees e2 
             WHERE e2.dept = e1.dept AND e2.salary > e1.salary) < 3

6. CACHE frequently used tables
   âœ… Good:
      CACHE TABLE employees;
      UNCACHE TABLE employees;

7. USE EXPLAIN to check execution plan
   âœ… Always:
      EXPLAIN SELECT * FROM ...
""")

# Demo: Broadcast hint
print("\nðŸ“Š DEMO: Broadcast Join Hint")
print("-" * 80)

# Small lookup table
lookup = spark.createDataFrame([
    ("Engineering", "Tech"),
    ("Sales", "Business"),
    ("Marketing", "Business"),
    ("HR", "Support"),
    ("Finance", "Support")
], ["department", "division"])

lookup.createOrReplaceTempView("lookup")

# Without broadcast hint
print("Without broadcast hint:")
result_no_hint = spark.sql("""
    SELECT e.name, e.department, l.division
    FROM employees e
    JOIN lookup l ON e.department = l.department
""")
result_no_hint.explain()

# With broadcast hint
print("\nWith broadcast hint:")
result_with_hint = spark.sql("""
    SELECT /*+ BROADCAST(l) */ e.name, e.department, l.division
    FROM employees e
    JOIN lookup l ON e.department = l.department
""")
result_with_hint.explain()

print("""
ðŸ’¡ Broadcast Hint:
   - Use /*+ BROADCAST(table) */ before SELECT
   - Forces small table to be broadcast
   - Avoids shuffle
   - Much faster for small dimension tables
""")

================================================================================
âš¡ 7. SQL PERFORMANCE TIPS
================================================================================

ðŸ’¡ PERFORMANCE TIPS:

1. FILTER EARLY (Predicate Pushdown)
   âœ… Good:
      SELECT * FROM large_table
      WHERE date = '2024-01-01'

   âŒ Bad:
      SELECT * FROM (
          SELECT * FROM large_table
      ) WHERE date = '2024-01-01'

2. SELECT ONLY NEEDED COLUMNS (Column Pruning)
   âœ… Good:
      SELECT id, name, salary FROM employees

   âŒ Bad:
      SELECT * FROM employees

3. USE BROADCAST JOIN for small tables
   âœ… Good:
      SELECT /*+ BROADCAST(small_table) */
      FROM large_table JOIN small_table

4. AVOID CROSS JOIN
   âŒ Bad:
      SELECT * FROM table1 CROSS JOIN table2

   âœ… Good:
      SELECT * FROM table1 JOIN table2 ON table1.id = table2.id

5. USE WINDOW FUNCTIONS instead of self-joins
   âœ… Good:
      SELECT *, ROW_NUMBER() OVER (PARTITION BY dept ORDER BY salary DESC)

   âŒ Bad:
      SELECT * FROM employees e1
      WHERE (SELECT COUNT(*) FROM employees e2
             WHERE e2.dept = e1.dept AND e2.salary > e1.salary) < 3

6. CACHE frequently used tables
   âœ… Good:
      CACHE TABLE employees;
      UNCACHE TABLE employees;

7. USE EXPLAIN to check execution plan
   âœ… Always:
      EXPLAIN SELECT * FROM ...


ðŸ“Š DEMO: Broadcast Join Hint
--------------------------------------------------------------------------------
Without broadcast hint:
== Physical Plan ==
AdaptiveSparkPlan isFinalPlan=false
+- Project [name#1, department#3, division#1276]
   +- SortMergeJoin [department#3], [department#1275], Inner
      :- Sort [department#3 ASC NULLS FIRST], false, 0
      :  +- Exchange hashpartitioning(department#3, 200), ENSURE_REQUIREMENTS, [plan_id=2467]
      :     +- Project [name#1, department#3]
      :        +- Filter isnotnull(department#3)
      :           +- Scan ExistingRDD[employee_id#0,name#1,age#2L,department#3,country#4,salary#5L,manager_id#6,status#7,hire_date#8]
      +- Sort [department#1275 ASC NULLS FIRST], false, 0
         +- Exchange hashpartitioning(department#1275, 200), ENSURE_REQUIREMENTS, [plan_id=2468]
            +- Filter isnotnull(department#1275)
               +- Scan ExistingRDD[department#1275,division#1276]



With broadcast hint:
== Physical Plan ==
AdaptiveSparkPlan isFinalPlan=false
+- Project [name#1, department#3, division#1276]
   +- BroadcastHashJoin [department#3], [department#1275], Inner, BuildRight, false
      :- Project [name#1, department#3]
      :  +- Filter isnotnull(department#3)
      :     +- Scan ExistingRDD[employee_id#0,name#1,age#2L,department#3,country#4,salary#5L,manager_id#6,status#7,hire_date#8]
      +- BroadcastExchange HashedRelationBroadcastMode(List(input[0, string, false]),false), [plan_id=2501]
         +- Filter isnotnull(department#1275)
            +- Scan ExistingRDD[department#1275,division#1276]



ðŸ’¡ Broadcast Hint:
   - Use /*+ BROADCAST(table) */ before SELECT
   - Forces small table to be broadcast
   - Avoids shuffle
   - Much faster for small dimension tables

---

## ðŸŽ“ **KEY TAKEAWAYS**

### **âœ… What You Learned:**

1. **Window Functions**
   - ROW_NUMBER(), RANK(), DENSE_RANK()
   - LAG(), LEAD()
   - Running totals, moving averages
   - FIRST_VALUE(), LAST_VALUE()
   - NTILE(), PERCENT_RANK()

2. **Complex Joins**
   - Self Join (hierarchical data)
   - Cross Join (cartesian product)
   - Multiple Joins

3. **Set Operations**
   - UNION / UNION ALL
   - INTERSECT
   - EXCEPT

4. **Pivot & Unpivot**
   - PIVOT: Rows â†’ Columns
   - UNPIVOT: Columns â†’ Rows (LATERAL VIEW STACK)
   - CASE WHEN for flexible pivoting

5. **Advanced Aggregations**
   - GROUPING SETS
   - ROLLUP (hierarchical)
   - CUBE (all combinations)
   - GROUPING() function

6. **Performance Tips**
   - Filter early
   - Select only needed columns
   - Use broadcast join for small tables
   - Avoid cross join
   - Use window functions instead of self-joins
   - Cache frequently used tables

### **ðŸ“Š Quick Reference:**

```sql
-- Window Function
SELECT 
    col1,
    ROW_NUMBER() OVER (PARTITION BY col2 ORDER BY col3) as rn
FROM table

-- Self Join
SELECT e.*, m.name as manager_name
FROM employees e
LEFT JOIN employees m ON e.manager_id = m.employee_id

-- Pivot
SELECT * FROM table
PIVOT (
    COUNT(*) FOR country IN ('USA', 'UK')
)

-- Rollup
SELECT dept, country, COUNT(*)
FROM employees
GROUP BY ROLLUP(dept, country)
```

### **ðŸš€ Next:** Day 5 - Lesson 3: Catalog & Metadata

---

In [25]:
# Cleanup
spark.catalog.clearCache()
spark.stop()

print("âœ… Spark session stopped")
print("\nðŸŽ‰ DAY 5 - LESSON 2 COMPLETED!")
print("\nðŸ’¡ Remember:")
print("   - Window functions are powerful for analytics")
print("   - Use ROLLUP/CUBE for reports with subtotals")
print("   - Broadcast small tables for better performance")
print("   - EXPLAIN your queries to check execution plan")
print("   - SQL and DataFrame API have same performance!")
print("\nðŸ”¥ Quote: 'Window functions: The Swiss Army knife of SQL!' ðŸªŸ")

âœ… Spark session stopped

ðŸŽ‰ DAY 5 - LESSON 2 COMPLETED!

ðŸ’¡ Remember:
   - Window functions are powerful for analytics
   - Use ROLLUP/CUBE for reports with subtotals
   - Broadcast small tables for better performance
   - EXPLAIN your queries to check execution plan
   - SQL and DataFrame API have same performance!

ðŸ”¥ Quote: 'Window functions: The Swiss Army knife of SQL!' ðŸªŸ